app/controllers/api/cats_controller.rb

  def index
    @cats = Cat.where(user_id: current_user.id)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save
---
INSERT INTO "cats" ("user_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "Candy"], ["description", "House Cat"], ["created_at", 2017-01-12 16:47:03 UTC], ["updated_at", 2017-01-12 16:47:03 UTC]]

  def destroy
    @cat = Cat.find_by(id: params[:id])
    @cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]