app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "email", "address", "city", "state", "zip", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.status = 'Maybe'
    @user.profile = 'No Profile Yet' unless @user.profile
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "status" = $1, "sex" = $2, "profile" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["status", "Accepting"], ["sex", ""], ["profile", ""], ["updated_at", 2017-01-13 00:58:56 UTC], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user.update(edit_params)